read_ilang /home/oshears/Documents/openfpga/OpenFPGA/debug/architectures/primitive/prim.il

# Technology mapping
hierarchy -top fpga_design
proc
techmap -D NO_LUT -map +/adff2dff.v

# Synthesis
flatten
opt_expr
opt_clean
check
opt -nodffe -nosdff
fsm
opt -nodffe -nosdff
wreduce
peepopt
opt_clean
opt -nodffe -nosdff
memory -nomap
opt_clean
opt -fast -full -nodffe -nosdff
memory_map
opt -full -nodffe -nosdff
techmap
opt -fast -nodffe -nosdff
clean

# LUT mapping
abc -lut 4

# Check
synth -run check

# Clean and output blif
opt_clean -purge
write_blif /home/oshears/Documents/openfpga/OpenFPGA/debug/architectures/primitive/out.blif
write_json /home/oshears/Documents/openfpga/OpenFPGA/debug/architectures/primitive/out.json
write_ilang /home/oshears/Documents/openfpga/OpenFPGA/debug/architectures/primitive/out.il